In [1]:
import pandas as pd

In [5]:
data_csv_path = 'https://raw.githubusercontent.com/geekcourses/JupyterNotebooksExamples/master/datasets/various/drinks.csv'
df = pd.read_csv(data_csv_path)
df.head(3)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF

In [17]:
# get continent column
df['continent']
# df.continent

0      AS
1      EU
2      AF
3      EU
4      AF
       ..
188    SA
189    AS
190    AS
191    AF
192    AF
Name: continent, Length: 193, dtype: object

In [21]:
# get multiple columns
df[['continent','beer_servings']]

    continent
0          AS
1          EU
2          AF
3          EU
4          AF
..        ...
188        SA
189        AS
190        AS
191        AF
192        AF

[193 rows x 1 columns]

In [22]:
df

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [27]:
# Get country name and continent from  row 2
df.loc[2,['country','continent']]

country      Algeria
continent         AF
Name: 2, dtype: object

In [30]:
# Get country name and continent from  row 2 and 4 and 6
df.loc[ [2,4,6],['country','continent'] ]

     country continent
2    Algeria        AF
4     Angola        AF
6  Argentina        SA

In [29]:
# Get country name of each second row
df.loc[::2, 'country']

0      Afghanistan
2          Algeria
4           Angola
6        Argentina
8        Australia
          ...
184            USA
186     Uzbekistan
188      Venezuela
190          Yemen
192       Zimbabwe
Name: country, Length: 97, dtype: object

In [32]:
df.shape

(193, 6)

In [36]:
df.set_index('country', inplace=True)

In [38]:
df.loc['Bulgaria', 'beer_servings']

231